"OK" = "確定";
"Back" = "返回";
"Done" = "完成";
"Close" = "關閉";
"Sorry" = "抱歉";
"Cancel" = "取消";
"Setting" = "設定";
"Photos" = "照片";
"Videos" = "視頻";
"Preview" = "預覽";
"Full image" = "原圖";
"Processing..." = "正在處理...";
"Can not use camera" = "無法使用相機";
"Synchronizing photos from iCloud" = "正在從iCloud同步照片";
"Can not choose both video and photo" = "選擇照片時不能選擇視頻";
"Can not choose both photo and GIF" = "選擇照片時不能選擇 GIF";
"Select the video when in multi state, we will handle the video as a photo" = "多選狀態下選擇視頻，默認將視頻當圖片發送";
"Can not jump to the privacy settings page, please go to the settings page by self, thank you" = "無法跳轉到隱私設定頁面，請手動前往設定，謝謝";

"Select a maximum of %zd photos" = "你最多只能選擇%zd張照片";
"Select a minimum of %zd photos" = "請至少選擇%zd張照片";
"Allow %@ to access your album in \"Settings -> Privacy -> Photos\"" = "請在iPhone的\"設定-隱私權-照片\"選項中，\r允許%@訪問你的手機相冊";
"Please allow %@ to access your camera in \"Settings -> Privacy -> Camera\"" = "請在iPhone的\"設定-隱私權-相機\"中允許%@訪問相機";

"Apply" = "申請";
"Reject" = "拒絕";
"Allow" = "允許";
"Not Allow" = "不允許";

"Obtain your location info" = "獲取你的位置信息";
"Obtain your profile photo" = "讀取設備上的照片及文件";
"Access and save pictures or videos on device" = "保存圖片或視頻到你的相冊";
"Use your camera" = "使用你的攝像頭";
"Use your microphone" = "訪問你的麥克風";
"Use your bluetooth" = "使用你的藍牙";
"Use your addressBook" = "使用你的通訊錄";
"Obtain your phoneNumber" = "獲取你的手機號碼";
"Obtain your userProfile" = "獲取你的個人資訊";

"Selected for %ld seconds" = "已選取%lds";
"Allow %@ to access your all photos" = "你已設定%@只能訪問相册部分照片，建議允許訪問「所有照片」";
"Add more accessible photos" = "添加更多\n可訪問照片";
"Edit" = "編輯";

"Loading failed, please try again later" = "加載失敗，請稍後再試";

"Forward To" = "轉發";
"Settings" = "設置";
"Feedback" = "反饋與投訴";
"Restart" = "重新進入\n%@";
"Open Debug" = "打開調試";
"Close Debug" = "關閉調試";
"Share" = "分享";
"Wechat" = "微信好友";
"Add Favorite" = "添加收藏";
"Cancel Favorite" = "取消收藏";
"Add To Desktop" = "添加到桌面";

"Add Favorite Success" = "添加收藏成功";
"Add Favorite Failure" = "添加收藏失敗";
"Cancel Favorite Success" = "取消收藏成功";
"Cancel Favorite Failure" = "取消收藏失敗";
"Add To Desktop Failure" = "添加到桌面失敗";

"%@ Authorizations History" = "%@授權管理";
"No access history of My Information & Authorizations." = "未使用你的個人信息與權限";
"No %@" = "暫無%@";

"Allow \"%@\" to use" = "允許“%@”使用";

"\"%@\"does not use any permissions" = "\"%@\"未使用任何許可權";

"Search for location" = "搜索地點";
"Location" = "所在位置";
"Don't show location" = "不顯示位置";
"Search nearby" = "搜索附近位置";
"Office Building" = "寫字樓";

"User info" = "用戶信息";
"Location info" = "位置信息";
"Background Location info" = "後臺定位";

"Mobile address book" = "通訊錄";
"Microphone" = "麥克風";
"Camera" = "相機";
"Album" = "相冊";
"Calendar" = "日曆";
"Buletooth" = "藍牙";
"QR Code" = "二維碼/條碼";
"License Plate" = "車牌";
"Phone" = "手機號";

"About" = "關於";
"Basic Info" = "基礎信息";
"Account" = "帳號主體";
"Desc" = "詳細描述";
"Version" = "版本號";
"Notes" = "版本說明";
"Labels" = "%@標籤";
"Global Privacy Statement" = "服務隱私及數據提示";
"The developer of this Mini-App confirm that it has not processed any information of the user in any way. If there is any subsequent handling of user information, Mini-App Privacy Guidelines will be updated in a timely manner. If you find that the developer has mishandled your privacy information, you may click here to take a issue." = "本％@開發者承諾並保證，未以任何方式處理用戶的任何信息。如後續有處理用戶信息，會及時更新《％@隱私保護指引》，如果你發現開發者對你的隱私信息進行不當處理，可進行投訴。";
"Statement of Service" = "服務聲明";
"Developers handle your personal information in strict accordance with %@ Privacy Guidelines, and you may take a issue if  you find that a developer has mishandled your private information." = "開發者嚴格按照%@處理你的個人信息，如果你發現開發者對你的隱私信息進行不當處理，可進行%@。";
"The Mini-App is provided to you by the developer, who assumes full responsibility for the authenticity, legality and validity of the information content, data material and its operation of this service." = "本%@服務由開發者向你提供，開發者對本服務信息內容、數據資料及其運營行為的真實性、合法性及有效性承擔全部責任。";
"Instruction" = "第三方用戶信息授權說明";
"\"Privacy Guidelines for %@\"" = "《%@隱私保護指引》";
"take a issue" = "投訴";
"App disable feedback function" = "App禁用迴響功能";
"After your authorization, the developer of the mini-app, the developer of the substitute development service provider, and the developer of the plug-in referenced by the mini-app will collect your %@ information to provide you with relevant services. The developers handle your personal information in strict accordance with the %@, and you may take a issue if you find that the developers have mishandled your personal information." = "你授權後，％@開發者、代開發服務商的開發者、％@引用的插件開發者將收集你的%@信息，為你提供相關服務。開發者嚴格按照％@處理你的個人信息，如你發現開發者不當處理你的個人信息，可進行%@。";
" and %@ others"="和其他%@個";

"Recents" = "最近";
"Save Image" = "保存圖片";
"Save Video" = "保存視頻";
"Save" = "保存";
"Share" = "分享";
"Effective after reopening" = "重新打開後生效";

"Failed to get the picture" = "獲取圖片失敗";
"This device does not have an album" = "該設備無相冊";
"Failed to process image" = "處理圖像失敗";
"No QR code/barcode found" = "未發現二維碼/條碼";
"No QR code found" = "未發現二維碼";
"No barcode found" = "未發現條碼";
"No Data Matrix code found" = "未發現Data Matrix碼";
"No pdf417 code found" = "未發現pdf417碼";
"Only QR codes are supported below iOS 11" = "iOS 11以下只支持識別二維碼";
"Please tap to continue" = "請輕觸繼續";

// page title
"Not Found" = "頁面不存在";
"Not Registered" = "非備案域名";
"In The Blacklist" = "黑名單域名";

// title
"Unable to open the page" = "無法打開頁面";
"Unable to open this page" = "無法打開域名";

// FATErrorCodeUnknown 9999
"No %@ found in service" = "該服務器下無%@";
// FATErrorCodeAppKeyInvalid 10000
"SDK not initialized or App Key is illegal" = "未初始化SDK或者appKey不合法";
"[%@]parameter missing" = "[%@]參數缺失";
"[%@]App Key is invalid" = "[%@]無效的AppKey";
"[%@]bundleID is not match appKey" = "[%@]bundleID is not match appKey";
// FATErrorCodeInvalidParam 10001
"Parameter is illegal" = "參數不合法";

"Request parameter is illegal" = "request 參數不合法";
"parentVC is illegal" = "parentVC 參數不合法";
"appId is not configured" = "appId 未配置";

"SDK Key is not allowed to open offline %@" = "SDK Key不支持打開離線%@";
"Packages is not configured" = "packages未設置";

"%@ information is empty" = "%@信息爲空";
"%@ information encrypted is empty" = "%@信息解密後爲空";
"%@ data type error" = "%@數據類型錯誤";
"%@ type is missing" = "%@類型缺失";
"Unkown %@ type" = "未知的%@類型";
"CodeId is invalid" = "無效的codeId";
"%@ ID is invalid" = "無效的%@ID";
"QR Code form is illegal" = "二維碼格式不合法";

"Device type is not supported" = "設備類型暫不支持";
"The number of available devices has reached its maximum" = "當前可用設備數量已達上限";

"The page does not exist. Please contact the developer" = "該頁面不存在，請與開發者聯繫";

// FATErrorCodeDomainInvalid 10002
"ENV verification failed" = "環境信息校驗失敗";
"%@ domain not initialized" = "當前%@所屬環境與SDK初始化環境不壹致";
"License domain is invalid" = "license域名校驗失敗";
"Service is not initialized" = "該服務器未初始化配置";
"The domain %@ is not registered. Please give feedback to developer by taking a functionality issue." = "域名%@未登記，無法打開當前頁面，請聯系開發者迴響問題。";
"The domain %@ has been blacklisted" = "域名%@已被運營端放入黑名單，無法打開當前頁面，請聯系開發者迴響問題。";

// FATErrorCodeNetworkNotReach 10003
"Please confirm your network and reopen %@" = "請檢查網絡後重新進入%@";
"The Internet connection appears to be offline." = "似乎已斷開與互聯網的連接";
"The request timed out." = "請求超時。";

// FATErrorCodeRequestFail 11000
"Network request failed" = "網絡請求失敗";
"Request failed" = "服務異常，接口請求失敗";
"%@ request failed" = "服務異常，%@詳情接口請求失敗";
"Foundation library request failed" = "服務異常，基礎庫詳情接口請求失敗";
"Batch %@ request failed" = "批量查詢%@詳情接口請求失敗";
"DV request failed" = "服務異常，域名證書請求失敗";

// FATErrorCodeResponseDataInvalid 11001
"Foudation library response error" = "服務異常，基礎庫詳情接口數據異常";
"Foudation library response decrypted error" = "服務異常，基礎庫詳情接口返回數據解密出錯";
"%@ response error" = "服務異常，%@詳情接口返回數據異常";
"%@ response decrypt error" = "服務異常，%@詳情接口返回數據解密出錯";
"response error" = "服務異常，接口返回數據異常";
"response decrypt error" = "服務異常，接口返回數據解密出錯";
"%@ service error, please retry" = "%@服務異常，請稍後再試";
"Batch %@ response error" = "批量查詢%@詳情接口，返回數據異常";

// FATErrorCodeDownloadURLInvalid 11002
"Download address error" = "下載地址異常";
"Download address of %@ error, downloading failed" = "%@下載地址異常，無法下載";
"AppId is empty, downloading failed" = "AppId爲空，無法下載";
"Downloaded address of foundation library error, downloading failed" = "基礎庫下載地址異常，無法下載";

// FATErrorCodeDownloadDirectoryError 11003
"Extract directory cannot be empty" = "解壓目錄不能爲空";
"Downloading directory error" = "下載目錄出錯";
"Document name error" = "文件名稱出錯";
"Document name of foundation library error" = "基礎庫文件目錄異常";
"Storage directory error" = "存儲目錄異常";

// FATErrorCodeDownloadFail 11004
"Server error, downloading failed" = "服務器異常，下載失敗";

// FATErrorCodeResponseDataUnchanged 11005
"Service error, Foundation Library detail API response with empty data" = "服務異常，基礎庫詳情接口返回數據爲空";
"Service error, %@ detail API response with empty data" = "服務異常，%@詳情接口返回數據爲空";
"Service error, API response with empty data" = "服務異常，接口返回數據爲空";

// FATErrorCodeZipInvalid 12000
"MD5 file is invalid" = "文件異常，md5值校驗失敗";
"Unzip file failed" = "文件異常，無法解壓";

"Unzip %@ package failed" = "%@壓縮包異常，解壓失敗";
"Copy %@ package failed" = "%@壓縮包異常，拷貝失敗";
"%@ package is missing" = "%@壓縮包異常，文件缺失";

"Unzip foudation library failed" = "基礎庫解壓失敗";

"%@ offline pacakge is missing" = "%@離線包不存在";

"Foudation library offline package is missing" = "基礎庫離線包不存在";
"Unzip foudation library offline package failed" = "基礎庫離線包解壓失敗";

// FATErrorCodeCopyResourceFail 12001
"Copy resources to running directory failed" = "拷貝資源至運行目錄失敗";
"%@ subpackage resources not found" = "%@未找到分包資源";

// FATErrorCodeServiceNotFound 12002
"Service.html is missing, please confirm pakcage is compiled" = "service.html不存在，請檢查代碼包是否已編譯";

// FATErrorCodeNotTrialAccess 13000
"Failed to obtain trial version" = "獲取體驗版本失敗";
"No trial access." = "沒有體驗權限";
"No trial access. Please contact the administrator." = "抱歉，您沒有體驗的權限，請聯系管理員";
"No access. Please contact the administrator." = "抱歉，您沒有權限，請聯系管理員";

// FATErrorCodeTrialCanceled 13001
"Preview edition is cancelled" = "體驗版本已取消";
"Preview edition is cancelled, please confirm Preview Edition is configured" = "當前體驗版本已取消，請重新設置體驗版本";

// FATErrorCodeTempExpried 13002
"QR code is expired" = "二維碼已過期，請重新獲取";

// FATErrorCodeSameAppID 13003
"APP ID is duplicate" = "appId相同";

// FATErrorCodeNotExamineAccess 13005
"No examine access." = "沒有審核權限";

// FATErrorCodeNotDevelopAccess 13006
"No develop access." = "沒有開發權限";

// FATErrorCodeAppletNotFound 14000
"%@ not found with appId" = "未找到appId指定的%@";

// FATErrorCodeForegroundAppletNotFound 14001
"%@ not found that is running" = "沒有找到前台運行的%@";

// Requset API
"FS_APP_ID_NOT_FOUND_T" = "%@打開失敗";
"FS_APP_ID_NOT_FOUND_M" = "%@不存在，請查檢 AppID";

"FS_APP_IS_FORBIDDEN_T" = "%@不可用";
"FS_APP_IS_FORBIDDEN_M" = "%@被禁用，相關服務暫不可用";

"FS_APP_NOT_ASS_BIND_T" = "%@不可用";
"FS_APP_NOT_ASS_BIND_M" = "%@與本應用的關聯關係沒有生效，請檢查關聯關係";

"FS_APP_PAY_EXPIRE_T" = "%@不可用";
"FS_APP_PAY_EXPIRE_M" = "%@已過有效期，相關服務暫不可用";

"FS_APP_SEQUENCE_NOT_FOUND_T" = "%@打開失敗";
"FS_APP_SEQUENCE_NOT_FOUND_M" = "%@版本錯誤";

"FS_BIND_IS_FORBIDDEN_T" = "%@不可用";
"FS_BIND_IS_FORBIDDEN_M" = "BundleID 被禁用，相關服務暫不可用";

"FS_BIND_NOT_FOUND_T" = "服務不可用";
"FS_BIND_NOT_FOUND_M" = "當前應用未在平臺備案，請檢查 SDK 初始化配置信息";

"FS_BIND_PAY_EXPIRE_T" = "%@不可用";
"FS_BIND_PAY_EXPIRE_M" = "當前應用已過期";

"FS_COOPERATION_TERMINATED_T" = "%@不可用";
"FS_COOPERATION_TERMINATED_M" = "當前應用已停止合作";

"FS_DB_ERR_T" = "服務不可用";
"FS_DB_ERR_M" = "數據庫內部錯誤";

"FS_GET_DOMAIN_INFO_ERROR_T" = "服務不可用";
"FS_GET_DOMAIN_INFO_ERROR_M" = "獲取域名失敗，相關服務不可用";

"FS_GET_GROUP_FAILED_T" = "服務不可用";
"FS_GET_GROUP_FAILED_M" = "企業狀態校驗異常";

"FS_LICENSE_INVALID_ERR_T" = "%@不可用";
"FS_LICENSE_INVALID_ERR_M" = "您當前的 license 異常，請聯繫管理員處理";

"FS_ORGAN_STATUS_INVALID_T" = "%@不可用";
"FS_ORGAN_STATUS_INVALID_M" = "%@所屬企業帳號狀態異常，請登錄平臺處理";

"FS_SERVICE_UNAVAILABLE_T" = "%@不可用";
"FS_SERVICE_UNAVAILABLE_M" = "%@已下架，想關服務暫不可用";

"FS_SIGNATURE_SDKKEY_INVAILD_T" = "%@不可用";
"FS_SIGNATURE_SDKKEY_INVAILD_M" = "SDK Key 出錯，請聯繫管理員處理";

"FS_SYSTEM_CALL_T" = "服務不可用";
"FS_SYSTEM_CALL_M" = "系統內部錯誤";

"OVER_FRQ_LIMIT_T" = "服務不可用";
"OVER_FRQ_LIMIT_M" = "抱歉，由於資源不足，相關服務暫不可用";

"FS_QR_CODE_EXPIRED_T" = "二維碼已過期，請重新獲取";

"FS_NOT_TRIAL_INFO_T" = "體驗版本已取消";
"FS_NOT_TRIAL_INFO_M" = "當前體驗版本已取消，請重新設置體驗版本";

"FC_TRIAL_USERID_NO_MATCH_T" = "沒有體驗權限";
"FC_TRIAL_USERID_NO_MATCH_M" = "抱歉，您沒有體驗的權限，請聯繫管理員";

"FC_RULE_TRIAL_USERID_NO_MATCH_T" = "沒有體驗權限";
"FC_RULE_TRIAL_USERID_NO_MATCH_M" = "抱歉，您沒有體驗的權限，請聯繫管理員";

"FC_DEV_USERID_NO_MATCH_T" = "沒有開發權限";
"FC_DEV_USERID_NO_MATCH_M" = "抱歉，您沒有權限，請聯繫管理員";

"FS_ADMIN_AUTH_ERR_T" = "沒有審核權限";
"FS_ADMIN_AUTH_ERR_M" = "抱歉，您沒有的權限，請聯繫管理員";

"Apple Maps" = "蘋果地圖";
"Baidu Maps" = "百度地圖";
"Amap" = "高德地圖";
"Google Maps" = "谷歌地圖";
"Tencent Maps" = "騰訊地圖";
"Navigate to" = "導航到";

"While Using the Mini-App" = "使用％@時";
"While Using the Mini-App and After Leaving" = "使用％@時和離開後";

"Allow While Using the Mini-App" = "使用％@時允許";
"Allow While Using the Mini-App and After Leaving" = "使用％@時和離開後允許";

"Confirm exit the Mini-App" = "確定退出%@";
"Remote debugging parameter is illegal" = "遠程調試參數不合法";
"Remote debugging connection disconnected" = "遠程調試連接已斷開";
"Remote debugging connection failed. Please check the network and try again" = "遠程調試連接失敗，請檢查網絡後重試";

"Reminder" = "溫馨提示";
"The first %d files selected are valid" = "選擇前%d個文件有效";

// toast
"apiServer number exceeds license limit" = "初始化服務器個數超過限製";
